Autodesk.Revit.DB.ExportPatternTable.Remove(Autodesk.Revit.DB.ExportPatternKey)
Removes the pair (key, info) by pattern key.
exportPatternKey:
The export pattern key.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.ExportPatternTable.Add(Autodesk.Revit.DB.ExportPatternKey,Autodesk.Revit.DB.ExportPatternInfo)
Inserts a (key,info) pair into Export pattern table.
exportPatternKey:
The export pattern key to be added.
exportPatternInfo:
The export pattern info to be added.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The key already exists in the table.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.ExportPatternTable.GetExportPatternInfo(Autodesk.Revit.DB.ExportPatternKey)
Gets a copy of the pattern info associated to the input pattern key.
exportPatternKey:
The export pattern Key.
Returns:
Return the patternInfo for this key.
Throws Autodesk.Revit.Exceptions.ArgumentException:
An entry with the given key is not present in the table.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.ExportPatternTable.ContainsKey(Autodesk.Revit.DB.ExportPatternKey)
Checks whether a pattern key exists in the table.
exportpatternKey:
The export pattern Key.
Returns:
True if the pattern key exists in the table.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.ExportPatternTable
A table supporting a mapping of FillPatterns in Revit to pattern names that will be set
in the target export format.
Remarks:
This table is structured as a mapping from Autodesk.Revit.DB.ExportPatternKey to
Autodesk.Revit.DB.ExportPatternInfo members.  The Autodesk.Revit.DB.ExportPatternKey
contains the identification information for the pattern table: the Revit fill pattern type and name.  The
Autodesk.Revit.DB.ExportPatternInfo contains the pattern name to use in the export format.
The table can be accessed via direct iteration as a collection of KeyValuePairs, or by traversal of the stored keys
obtained from GetKeys(), or via specific lookup of a key constructed externally.  In all cases, the
Autodesk.Revit.DB.ExportPatternInfo returned will be a copy of the Autodesk.Revit.DB.ExportPatternInfo
from the table.  In order to make changes to the Autodesk.Revit.DB.ExportPatternInfo and use those settings during export,
set the modified Autodesk.Revit.DB.ExportPatternInfo back into the table using the same key.
Since:
2014

Autodesk.Revit.DB.ExportPatternTable.Item(Autodesk.Revit.DB.ExportPatternKey)
A copy of the Autodesk.Revit.DB.ExportPatternInfo for the pattern's Autodesk.Revit.DB.ExportPatternKey.
Remarks:
When getting this property, it returns a copy of the Autodesk.Revit.DB.ExportPatternInfo from the table.  In order to
make changes to the Autodesk.Revit.DB.ExportPatternInfo and use those settings during export, set the modified
Autodesk.Revit.DB.ExportPatternInfo back into the table using the same key.
exportPatternKey:
The key.
Returns:
A copy of the Autodesk.Revit.DB.ExportPatternInfo.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When getting this property:
An entry with the given key is not present in the table.
Since:
2014